Revit 2024 API
ProductType Enumeration
An enumerated type containing the possible Revit product types.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ProductType
Visual Basic
Public Enumeration ProductType
Visual C++
public enum class ProductType
Members
Member name | Description
Architecture |  Architecture.
Structure |  Structure.
MEP |  MEP.
Revit |  Revit.
LT |  LT.
Unknown |  Unknown.
See Also
Autodesk.Revit.ApplicationServices Namespace